; domain
(define (domain warehouse)
  (:requirements :strips :typing :negative-preconditions :universal-preconditions :quantified-preconditions :disjunctive-preconditions)
  (:types product product-type command worker location)
  
  (:predicates 
      (at ?w - worker ?l - location)
      (in-inventory ?p - product)
      (assigned ?p - product ?c - command)
      (free ?w - worker)
      (working-on ?w - worker ?c - command)
      (command-complete ?c - command)
      
      (mission-started ?c - command)
      (label-printed ?c - command)
      (ready-to-move ?c - command)
      (type-scanned ?t - product-type ?c - command)
      (checkpoint-verified ?t - product-type ?c - command)
      
      (is-type ?p - product ?t - product-type)
      (at-loc ?p - product ?l - location)
      (type-zone ?t - product-type ?l - location)
      (start-loc ?l - location)
      (items-picked-for-type ?t - product-type ?c - command)
      (picked ?p - product ?c - command)
      (requires-type ?c - command ?t - product-type)
)

    (:action New-mission-PDA
      :parameters (?w - worker ?c - command ?l - location)
      :precondition (and (free ?w) (at ?w ?l) (start-loc ?l) (not (mission-started ?c)))
      :effect (and (not (free ?w)) (working-on ?w ?c) (mission-started ?c))
    )

  (:action Print-Order-Label
      :parameters (?w - worker ?c - command ?l - location)
      :precondition (and (working-on ?w ?c) (at ?w ?l) (start-loc ?l) (not (label-printed ?c)))
      :effect (and (label-printed ?c) (ready-to-move ?c))
  )

(:action move
      :parameters (?w - worker ?from - location ?to - location)
      :precondition (and (at ?w ?from))
      :effect (and (not (at ?w ?from)) (at ?w ?to))
  )

    (:action Scan-Item-Type
    :parameters (?w - worker ?c - command ?t - product-type ?l - location)
    :precondition (and
        (working-on ?w ?c)
        (at ?w ?l)
        (type-zone ?t ?l)
        (not (type-scanned ?t ?c))
    )
    :effect (and
        (type-scanned ?t ?c)
        (not (ready-to-move ?c))
    )
)

  (:action add-to-order
      :parameters (?w - worker ?c - command ?p - product ?t - product-type ?l - location)
      :precondition (and (working-on ?w ?c) (at ?w ?l) (at-loc ?p ?l) (type-scanned ?t ?c) (is-type ?p ?t) (in-inventory ?p))
      :effect (and (not (in-inventory ?p)) (assigned ?p ?c))
  )

    (:action Scan-Checkpoint
      :parameters (?w - worker ?c - command ?t - product-type ?l - location)
      :precondition (and 
          (working-on ?w ?c) 
          (at ?w ?l) 
          (type-zone ?t ?l) 
          (type-scanned ?t ?c)
          ;; FORCE: Every product that is at this location AND is of this type
          ;; MUST have been removed from inventory (assigned).
          (forall (?p - product) 
              (imply (and (is-type ?p ?t) (at-loc ?p ?l)) 
                     (not (in-inventory ?p))))
      )
      :effect (and (checkpoint-verified ?t ?c) (ready-to-move ?c))
    )


(:action finish-command
      :parameters (?w - worker ?c - command)
      :precondition (and (working-on ?w ?c) 
                         (forall (?t - product-type) 
                             (imply (requires-type ?c ?t) (checkpoint-verified ?t ?c))))
      :effect (and 
          (free ?w) 
          (not (working-on ?w ?c)) 
          (command-complete ?c)
          ;;(not (mission-started ?c))
          (forall (?t - product-type) (not (type-scanned ?t ?c)))
          (forall (?t - product-type) (not (checkpoint-verified ?t ?c)))
      )
  )
)

; problem
(define (problem two-command-warehouse)
  (:domain warehouse)
  (:objects 
      a1 a2 b1 b2 - product
      typeA typeB - product-type
      cmd1 cmd2 - command
      worker1 - worker
      locStart locA locB - location
  )
  
  (:init 
      (free worker1)
      (at worker1 locStart)
      (start-loc locStart)
      
      ;; Inventory items
      (in-inventory a1) (in-inventory a2) (in-inventory b1) (in-inventory b2)
      
      ;; Mapping
      (at-loc a1 locA) (at-loc a2 locA) 
      (at-loc b1 locB) (at-loc b2 locB)
      (is-type a1 typeA) (is-type a2 typeA) 
      (is-type b1 typeB) (is-type b2 typeB)
      
      ;; Zones
      (type-zone typeA locA) (type-zone typeB locB)
  )
  
  (:goal (and 
      (command-complete cmd1)
      (command-complete cmd2)
      (assigned a1 cmd1) (assigned b1 cmd1)
      (assigned a2 cmd2) (assigned b2 cmd2)
  ))
)

; plan
1. (new-mission-pda worker1 cmd1 locstart)
   deleted: (free worker1)
   added: (working-on worker1 cmd1) (mission-started cmd1)
   goals met: 0 of 6
2. (move worker1 locstart loca)
   deleted: (at worker1 locstart)
   added: (at worker1 loca)
   goals met: 0 of 6
3. (scan-item-type worker1 cmd1 typea loca)
   added: (type-scanned typea cmd1)
   goals met: 0 of 6
4. (add-to-order worker1 cmd1 a1 typea loca)
   deleted: (in-inventory a1)
   added: (assigned a1 cmd1)
   goals met: 1 of 6
5. (move worker1 loca locb)
   deleted: (at worker1 loca)
   added: (at worker1 locb)
   goals met: 1 of 6
6. (scan-item-type worker1 cmd1 typeb locb)
   added: (type-scanned typeb cmd1)
   goals met: 1 of 6
7. (add-to-order worker1 cmd1 b1 typeb locb)
   deleted: (in-inventory b1)
   added: (assigned b1 cmd1)
   goals met: 2 of 6
8. (finish-command worker1 cmd1)
   deleted: (working-on worker1 cmd1) (type-scanned typea cmd1) (type-scanned typeb cmd1)
   added: (free worker1) (command-complete cmd1)
   goals met: 3 of 6
9. (move worker1 locb locstart)
   deleted: (at worker1 locb)
   added: (at worker1 locstart)
   goals met: 3 of 6
10. (new-mission-pda worker1 cmd2 locstart)
   deleted: (free worker1)
   added: (working-on worker1 cmd2) (mission-started cmd2)
   goals met: 3 of 6
11. (move worker1 locstart locb)
   deleted: (at worker1 locstart)
   added: (at worker1 locb)
   goals met: 3 of 6
12. (scan-item-type worker1 cmd2 typeb locb)
   added: (type-scanned typeb cmd2)
   goals met: 3 of 6
13. (add-to-order worker1 cmd2 b2 typeb locb)
   deleted: (in-inventory b2)
   added: (assigned b2 cmd2)
   goals met: 4 of 6
14. (move worker1 locb loca)
   deleted: (at worker1 locb)
   added: (at worker1 loca)
   goals met: 4 of 6
15. (scan-item-type worker1 cmd2 typea loca)
   added: (type-scanned typea cmd2)
   goals met: 4 of 6
16. (add-to-order worker1 cmd2 a2 typea loca)
   deleted: (in-inventory a2)
   added: (assigned a2 cmd2)
   goals met: 5 of 6
17. (finish-command worker1 cmd2)
   deleted: (working-on worker1 cmd2) (type-scanned typea cmd2) (type-scanned typeb cmd2)
   added: (free worker1) (command-complete cmd2)
   goals met: 6 of 6
